app/controllers/baskets_controller.rb

SELECT * FROM "products" WHERE ("products"."id" IN (1,2))
---
  def update
    if params[:id]
      product = Product.find(params[:id])