app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    session[:basket].each {|item| @order.products << Product.find(item) }
    if @order.save
---
INSERT INTO "items" ("order_id", "product_id") VALUES(1, 1)
INSERT INTO "orders" ("name", "room", "mobile", "created_at", "updated_at") VALUES('dfgdf', 'gdfgdf', '124345644', '2009-04-01 21:03:38', '2009-04-01 21:03:38')
SELECT * FROM "products" WHERE ("products"."id" IN (1,2))
UPDATE "products" SET "quantity" = 1, "updated_at" = '2009-04-01 21:35:23' WHERE "id" = 1